app/views/users/feed.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 82]]
---
<%@user.backee_posts.each do |post|%>