app/views/users/show.html.erb


<%@profile.posts.each do |post|%>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 82]]