app/views/posts/edit.html.erb

SELECT "genres".* FROM "genres"
---
<%=f.text_field :description%>
<%=f.collection_select :genre_id, Genre.all, :id, :style%>