app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 86]]
---
<p><%=post.description%></p>
<%post.comments.each do |comment| %>