app/views/posts/new.html.erb

SELECT "genres".* FROM "genres"
---
    <div>
        <%=f.collection_select :genre_id, Genre.all, :id, :style%>