app/controllers/application_controller.rb

    def feed
        @user = User.find(session[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 62], ["LIMIT", 1]]