app/controllers/comments_controller.rb

    def create
        @user.comments.build(content:params[:content],post_id:params[:post_id]).save
---
INSERT INTO "comments" ("user_id", "post_id", "created_at", "updated_at", "content") VALUES (?, ?, ?, ?, ?)  [["user_id", 95], ["post_id", 86], ["created_at", "2020-10-01 13:01:08.003973"], ["updated_at", "2020-10-01 13:01:08.003973"], ["content", "predy flour c:"]]

    def edit

        @post = Post.find(@comment.post.id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 86], ["LIMIT", 1]]

    def update
        # byebug
        @comment.update(comment_params)
---
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "asdf"], ["updated_at", "2020-10-01 13:39:19.827481"], ["id", 91]]

    def destroy
        Comment.destroy(params[:id])
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 91]]

    def current_comment

        @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 94], ["LIMIT", 1]]