app/controllers/posts_controller.rb

    def create
        @user.posts.build(post_params).save
---
INSERT INTO "posts" ("image_url", "description", "user_id", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def update
        @post.update(post_params)
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "NEW random image"], ["updated_at", "2020-09-30 22:21:47.777959"], ["id", 81]]

    def destroy
        Post.destroy(params[:id])
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 81]]

    def current_post
        @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 86], ["LIMIT", 1]]