app/controllers/slaps_controller.rb

INSERT INTO "slaps" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 95], ["post_id", 86], ["created_at", "2020-10-01 16:10:30.898969"], ["updated_at", "2020-10-01 16:10:30.898969"]]
SELECT "slaps".* FROM "slaps" WHERE "slaps"."user_id" = ? AND "slaps"."post_id" = ? LIMIT ?  [["user_id", 95], ["post_id", 86], ["LIMIT", 1]]
---
    def create
        Slap.find_or_create_by(user_id:@user.id,post_id:params[:post_id])

SELECT "slaps".* FROM "slaps" WHERE "slaps"."post_id" = ? AND "slaps"."user_id" = ? LIMIT ?  [["post_id", 86], ["user_id", 95], ["LIMIT", 1]]
DELETE FROM "slaps" WHERE "slaps"."id" = ?  [["id", 91]]
---
    def destroy
        slap = Slap.find_by(post_id:params[:post_id],user_id:@user.id)
        Slap.destroy(slap.id)