app/controllers/snaps_controller.rb

    def create
        Snap.find_or_create_by(user_id:@user.id,post_id:params[:post_id])
---
INSERT INTO "snaps" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 95], ["post_id", 86], ["created_at", "2020-10-01 15:01:10.555419"], ["updated_at", "2020-10-01 15:01:10.555419"]]
SELECT "snaps".* FROM "snaps" WHERE "snaps"."user_id" = ? AND "snaps"."post_id" = ? LIMIT ?  [["user_id", 95], ["post_id", 86], ["LIMIT", 1]]

    def destroy
        snap = Snap.find_by(post_id:params[:post_id],user_id:@user.id)
        Snap.destroy(snap.id)
---
SELECT "snaps".* FROM "snaps" WHERE "snaps"."post_id" = ? AND "snaps"."user_id" = ? LIMIT ?  [["post_id", 86], ["user_id", 95], ["LIMIT", 1]]
DELETE FROM "snaps" WHERE "snaps"."id" = ?  [["id", 91]]