app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 82], ["LIMIT", 1]]
---
    def show
        @profile = User.find(params[:id])

INSERT INTO "backs" ("backer_id", "backee_id") VALUES (?, ?)  [["backer_id", 84], ["backee_id", 82]]
SELECT "backs".* FROM "backs" WHERE "backs"."backer_id" = ? AND "backs"."backee_id" = ? LIMIT ?  [["backer_id", 84], ["backee_id", 82], ["LIMIT", 1]]
---
    def back
        Back.find_or_create_by(backer_id:session[:id],backee_id:params[:id])

SELECT "backs".* FROM "backs" WHERE "backs"."backer_id" = ? AND "backs"."backee_id" = ? LIMIT ?  [["backer_id", 84], ["backee_id", 82], ["LIMIT", 1]]
DELETE FROM "backs" WHERE "backs"."id" = ?  [["id", 44]]
---
    def forget
        back = Back.find_by(backer_id:session[:id],backee_id:params[:id])
        Back.destroy(back.id)

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["username", "ben"], ["created_at", "2020-09-30 23:47:35.804126"], ["updated_at", "2020-09-30 23:47:35.804126"], ["password_digest", "$2a$12$pUVD.apfX7tW2rRno94XWuI6vJLbuEAsDzbommo/2Rj0MzttafH0a"]]
---
    def create
        new_user = User.new(user_params)

        if new_user.save && user_params[:password] == user_params[:password_confirmation]