app/models/post.rb

SELECT COUNT(*) FROM "snaps" WHERE "snaps"."post_id" = ?  [["post_id", 11]]
---
    def snap_number
        self.snaps.count.to_s

SELECT COUNT(*) FROM "slaps" WHERE "slaps"."post_id" = ?  [["post_id", 11]]
---
    def slap_number
        self.slaps.count.to_s

SELECT "snaps".* FROM "snaps" WHERE "snaps"."post_id" = ?  [["post_id", 86]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 91], ["LIMIT", 1]]
---
    def snapped_users
        self.snaps.collect{|snap| snap.user}

SELECT "slaps".* FROM "slaps" WHERE "slaps"."post_id" = ?  [["post_id", 86]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 88], ["LIMIT", 1]]
---
    def slapped_users
        self.slaps.collect{|slap| slap.user}