app/models/user.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 82]]
---
    def backee_posts
        self.backees.collect{|user| user.posts}.flatten

SELECT 1 AS one FROM "users" INNER JOIN "backs" ON "users"."id" = "backs"."backer_id" WHERE "backs"."backee_id" = ? LIMIT ?  [["backee_id", 108], ["LIMIT", 1]]
---
    def backed_profile?(profile)
        self.backees.include?(profile)